Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གང་དག་རྟག་ཏུ་ཁྱོད་ཀྱི་མཚན་རྗེས་སུ་དྲན་ཞིང་ཡོངས་སུ་ལེན་པ་དེ་དག་ནི་བདེ་བར་ལྡན་པ་ལགས་སོ། །
en: The beings who have obtained and always remember your name are happy;

source: བདག་ཅག་མྱོང་བ་ལྟ་བུ་སྡུག་བསྔལ་ལས་ཀྱང་ཐར་བར་འགྱུར་རོ།
en: they are free from this kind of suffering that we experience.’

source: དེ་ནས་སེམས་ཅན་དེ་དག་གི་རྣ་བའི་བུ་གར། ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཟ་མ་ཏོག་བཀོད་པའི་སྒྲ་བྱུང་བ་དང་།
en: “At this, the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , issued forth into the ears of those beings.

source: སྐྱེས་བུ་དེ་དག་གིས་དེ་ཐོས་ནས། ཕྱིར་མི་ལྡོག་པའི་ས་བསྒྲུབས་ཤིང་ཤིན་ཏུ་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ།།
en: When they heard it, they reached an irreversible level and were established in the highest happiness.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བྱུང་ནས་ས་གཞན་ལྕགས་ལས་བྱས་པར་སོང་སྟེ།
en: “Bodhisattva Mahāsattva Avalokiteśvara then left for another land, which was made of iron,

source: གང་དུ་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་གཏོར་མ་ཞེས་བྱ་བ་མཆིས་པ་དེར་སོང་བ་དང་།
en: where he approached the asura king Bali.

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་གཏོར་མས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་རྒྱང་མ་ནས་འོང་བ་མཐོང་ནས་
en: “When the asura king Bali saw Bodhisattva Mahāsattva Avalokiteśvara approaching from the distance,

source: སླས་དང་། འཁོར་དང་། ལྷ་མ་ཡིན་སྒུར་པོ་དང་། ཐུང་ངུ་ལ་སོགས་པ་དུ་མ་དང་འགྲོགས་ཤིང་འཁོར་དང་བཅས་ཏེ་དོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: he went toward Bodhisattva Mahāsattva Avalokiteśvara, accompanied by his queens, his retinue, and many asuras such as Kubja and Vāmanaka with their retinues. Bali bowed down at his feet and said these words:

source: དེ་རིང་དུ་ནི་བདག་གི་ཚེའི་འབྲས་བུ་མཆིས་སོ། །
en: “ ‘On this day, my life has borne fruit.

source: དེ་རིང་དུ་ནི་བདག་གི་བསམ་པ་རྫོགས་སོ། །
en: On this day, my wishes have been fulfilled.

source: དེ་རིང་དུ་ནི་བདག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་ཏེ།
en: On this day, my wishes have been fulfilled,

source: གང་བདག་གིས་ཁྱོད་ཡང་དག་པར་མཐོང་བས་དེའི་ཚེ་ལུས་ཐམས་ཅད་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: For actually seeing you has brought me happiness for all my lifetimes.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་རིན་པོ་ཆེའི་ཁྲི་ཕུལ་ཏེ་
en: “Bali offered a bejeweled throne to Bodhisattva Mahāsattva Avalokiteśvara and

source: བཅོམ་ལྡན་འདས་སྡིག་པ་ལ་དགའ་བ། གཞན་གྱི་ཆུང་མ་ལ་ཆགས་པ། སྲོག་གཅོད་པ་ལ་བརྩོན་པ། ཕ་རོལ་གྱི་སྲོག་གཅོད་པ། རྒ་བ་དང་འཆི་བས་འཇིགས་པ་རྣམས་ལ་ཐུགས་རྗེས་གཟིགས་ཤིག །
en: ‘Bhagavat, look with compassion upon those who like to perform bad actions, who lust after the wives of others, who are dedicated to killing, who kill others, and who are old and dying.

source: འཁོར་བས་སྐྱོ་བ་རྣམས་ལ་སྐྱབས་མཛོད་ཅིག །
en: Be a refuge to those who are weary of saṃsāra.

source: མགོན་པོ་ཁྱོད་ནི་ཕ་དང་མར་གྱུར་པ་ལགས་ཀྱིས་བདག་ཅག་བཅིང་བས་བཅིངས་པ་རྣམས་ལ་ལམ་སྟོན་ཅིག
en: You, lord, be our father and mother and show the path to we who are bound in bondage.’

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: ‘Noble son, it is like this:

source: དཔེར་ན་གང་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བསོད་སྙོམས་འབུལ་བ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་བཤད་དོ།
en: I will explain how much merit is acquired by those who give alms to a tathāgata, an arhat, a samyaksaṃbuddha.

source: དཔེར་ན་ང་དང་འདྲ་བའི་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བཅུ་གཉིས་ཡོད་པར་གྱུར་ལ།
en: As a comparison, were there to be as many bodhisattvas like myself as there are grains of sand in twelve Ganges Rivers,

source: དེ་དག་ཀྱང་གནས་གཅིག་ཏུ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ལྷའི་བསྐལ་པར་གནས་སུ་བཅུག་ན་དེ་དག་གིས་ཀྱང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བགྲང་བར་མི་ནུས་ན། །
en: and were they to be in one place with every facility for a deva’s eon, they would still be unable to calculate that aggregation of merit.

source: ང་གཅིག་པུ་ལྷ་མ་ཡིན་གྱི་གནས་ན་གནས་པས་ལྟ་ཅི་སྨོས།
en: So it is needless to say that I cannot do so all by myself in the realm of the asuras.

source: དཔེར་ན་རྡུལ་ཕྲ་རབ་ཀྱི་ཚད་ནི་ངས་བགྲང་བར་ནུས་ཀྱི།
en: As a comparison, I can count how many atoms there are, but,

source: རིགས་ཀྱི་བུ་བསོད་སྙོམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ངས་བགྲང་མི་ནུས་སོ།
en: noble son, I cannot calculate the accumulation of merit through that alms giving.

source: དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོའི་ཐིགས་པ་ནི་ངས་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: As a comparison, I can count each drop in the vast extent of the ocean, but,

source: དཔེར་ན་གླིང་ཆེན་པོ་བཞི་པའི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཐམས་ཅད་རྣམས་ཀྱི་ལས་ལ་བརྩོན་པར་གྱུར་ལ།
en: As a comparison, if all the men, women, boys, and girls in the four continents were to apply themselves to work,

source: གླིང་ཆེན་པོ་བཞི་པའི་མི་དེ་དག་རྣམས་གཞན་ནི་མི་བྱེད་ཀྱི་ཡུངས་ཀར་འབའ་ཞིག་བྱེད་ལ་དུས་དུས་སུ་ཀླུའི་རྒྱལ་པོས་ཀྱང་ཆར་པའི་རྒྱུན་ཕབ་སྟེ།
en: and those people in the four continents were to do no other work than growing mustard, and from time to time the king of the nāgas would send down rain,

source: ཡུངས་ཀར་དེ་དག་ཀྱང་ལེགས་པར་གྲུབ་ནས་གཡུལ་གཅིག་ཏུ་བྱས་ཏེ་སྐྱེས་པ་དང་།
en: and the mustard would grow perfectly for one harvest;

source: བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཁུར་ཤིང་རྟ་དང་། བམ་པོ་དང་། སྐོན་པ་དང་། རྔ་མོ་དང་། བོང་བུ་དང་། བ་ལང་དང་། དེ་དག་ཐམས་ཅད་ལ་བཀལ་ཏེ་
en: and then if the men, women, boys, and girls were to load that mustard into carts, bags, and baskets, onto camels, donkeys, and cattle, and

source: གཡུལ་ཆེན་པོ་དེར་སྤུངས་ནས་
en: collect the great harvest together; and

source: བོང་བུ་དག་དང་། བ་ལང་དག་གིས་བཅགས་ཏེ་ཕུང་པོ་ཆེན་པོར་བྱས་ཀྱང་། །
en: then if the donkeys and cattle threshed it to make a vast heap of mustard seeds,

source: རིགས་ཀྱི་བུ་དེ་ནི་ངས་འབྲུ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: noble son, I could count each one of those grains,

source: དཔེར་ན་རི་རབ་ལྷུན་པོ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་འོག་ཏུ་ནུབ་པ་དང་།
en: As a comparison, the lower half of the supreme mountain Sumeru extends downward for 84,000 yojanas

source: འཕང་གི་སྲིད་དུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་པ་དེ་ནི་རིགས་ཀྱི་བུ་གྲོ་གའི་ཕུང་པོར་གྱུར་ལ།
en: and the upper half extends upward for 84,000 yojanas. Noble son, if Sumeru were to become a mass of birch bark;

source: རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ནི་སྣག་ཚས་ཡོངས་སུ་གང་བར་གྱུར།
en: if the vast ocean was to become an inkwell;

source: གླིང་བཞི་ན་གནས་པའི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་དག་ཐམས་ཅད་ནི་ཡི་གེ་བར་གྱུར་ཏེ།
en: and if all the men, women, boys, and girls who live in the four continents were to become scribes;

source: རི་རབ་ལྷུན་པོ་དང་མཉམ་པ་མཐའ་ཡས་མུ་མེད་པ་དེ་ཡི་གེར་བྲིས་ཀྱང་རིགས་ཀྱི་བུ་ཡི་གེ་དེ་རེ་རེ་ནས་ངས་བགྲང་ནུས་ཀྱི།
en: and if they were to write on the limitless, endless extent of Mount Sumeru as birch bark, I would be able to count each letter,

source: དཔེར་ན་ཡི་གེ་བ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་ལ་གནས་པར་གྱུར་ན།
en: As a comparison, if all those scribes were to become bodhisattvas on the tenth bhūmi,

source: གང་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་ལ་གནས་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ཙམ་པ་བསོད་སྙོམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་དེ་ཙམ་མོ།
en: then the accumulation of merit of all those bodhisattvas on the tenth bhūmi would then equal the accumulation of merit through that alms giving.

source: དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་གྱི་བྱེ་མ་ནི་བྱེ་མ་རེ་རེ་ནས་ངས་བགྲང་ནུས་ཀྱི།
en: As a comparison, I can count each grain of sand in the ocean,

source: དེ་ནས་ལྷ་མ་ཡིན་གཏོར་མ་མཆི་མ་དང་བཅས། ངོམ་ཟུང་གནག། དབུགས་ཀྱིས་བརྣངས་ཤིང་སྐད་ར་ར་པོར་གྱུར་ལ། ཤུགས་འབྱིན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “Then the asura king Bali, with tears, a darkened face, choking, with stuttering words and sighs, told Bodhisattva Mahāsattva Avalokiteśvara his story:

source: བདག་གཏོར་མ་སླས་དང་། འཁོར་དང་བཅས་པས་སྦྱིན་པ་ཇི་ལྟ་བུ་ཞིག་བགྱིས་ནས། །
en: “ ‘What kind of gift did I, Bali, make, with my queens and retinue,

source: ཚེ་འདི་ཉིད་ལ་བཅིངས་པ་ཐོབ་པར་གྱུར་ཏེ།
en: that brought me bondage in this lifetime?

source: བདག་གིས་ཞིང་ངན་པ་ལ་སྦྱིན་པ་བྱིན་ཏེ།
en: I made an offering to a bad recipient,

source: ལས་དེའི་འབྲས་བུ་མྱོང་བ་འདི་ལགས་པ་ལྟ།
en: and I am now experiencing the result of that action.

source: ཐམས་ཅད་མཁྱེན་པའི་ཞིང་ལ་ནི་ཐལ་བ་སྤར་བ་གང་གཏོར་ཀྱང་བདུད་རྩི་འགྲུབ་པར་འགྱུར་ན།
en: Even a handful of dust thrown toward an omniscient one transforms into amṛta,

source: བདག་གིས་མ་འཚལ་བས་མཆོད་སྦྱིན་མཆོད་པའི་ཚེ་མིའུ་ཐུང་གི་གཟུགས་ཀྱིས་སློང་བ་མཆིས་ནས་
en: but I made my offerings not knowing that, and made an offering to a petitioner who came to me in the form of a dwarf.

source: བདག་གིས་བལ་གླང་དང་། རྟའི་ཐེག་པ་ཅོད་པན་དང་རྣ་ཆ་དང་། སེ་མོ་དོ་མང་པོ་དང་ལྡན་པ་ནི་བཤམས།
en: “ ‘I had prepared offerings of elephant- and horse-drawn carts carrying diadems, earrings, and necklaces,

source: གཡག་རྔའི་རྡུལ་ཡབ་རིན་པོ་ཆེས་སྤྲས་པ་ནི་དཔྱངས་མུ་ཏིག་གི་སེ་མོ་དོ་དག་དང་མུ་ཏིག་ལས་བགྱིས་པའི་མཇུག་མ་དག་ནི་མུ་ཏིག་གི་དྲ་བ་དག་གིས་གཡོགས།
en: hung with precious yak-tail whisks, and covered with strings of pearls, a net of pearls as a rear adornment,

source: གསེར་གྱི་དྲིལ་བུ་དག་ནི་དངུལ་གྱིས་བརྒྱུས་ཏེ་སྒྲ་སིལ་སིལ་མཆི་ཞིང་།
en: and jingling golden bells hanging from silver cords.

source: གཞན་ཡང་གླང་སེར་སྐྱ་སྟོང་དག་རྨིག་པ་ནི་དངུལ་ལས་བགྱིས། རྭ་ནི་གསེར་ལས་བགྱིས་ཤིང་མུ་ཏིག་གི་དྲ་བས་གཡོགས་ཏེ་མཆི་བ་དེ་འདྲ་བའི་གླང་སེར་སྐྱ་དག་དང་།
en: “ ‘I had also prepared offerings of a thousand tawny cows with silver hooves, golden horns, and covered with nets of pearls.

source: གཞན་ཡང་བུད་མེད་གཞོན་ནུ་ཤིན་ཏུ་ཁ་དོག་བཟང་ཞིང་ཤ་རྒྱས་པ་དང་ལྡན་པ། །
en: “ ‘I had also prepared an offering of a thousand young women with excellent complexions, who were full-bodied,

source: ཤིན་ཏུ་སྡུག་པ་ལྷའི་བུ་མོ་དང་འདྲ་ཞིང་འགྲན་པ། །
en: very beautiful, similar to and rivaling divine maidens;

source: ལྷའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: adorned with divine jewelry;

source: ཅོད་པན་དང་། རྣ་ཆ་དང་། སེ་མོ་དོ་མང་པོ་ཐོགས་པ།
en: wearing diadems, earrings, and necklaces;

source: དཔུང་རྒྱན་དང་། གདུ་བུ་དང་། རྐང་པའི་གདུ་བུ་དང་། རྐེད་པའི་སྐ་རགས་ཀྱི་རྒྱན་དང་།
en: adorned with armlets, bracelets, anklets, and girdles;

source: སོར་གདུབ་དང་། སེ་རལ་གྱི་རྒྱན་དང་། མཐེ་བོ་གཡོན་པ་སོར་གདུབ་དང་ལྡན་པ།
en: and wearing rings, sash necklaces, and gold rings on the big toes of their left feet.

source: སྒྲ་སིལ་སིལ་མཆི་བ་དང་ལྡན་པ། གོས་ཚོན་སྣ་ཚོགས་སུ་བཅོས་པ་གྱོན་པ་
en: They jingled as they moved, and wore clothing of silks in a variety of colors.

source: གཞན་ཡང་རིན་པོ་ཆེའི་ཁྲིའུ་བརྒྱ་སྟོང་དག་དང་། གསེར་གྱི་ཕུང་པོ་དང་། དངུལ་གྱི་ཕུང་པོ་དང་། རིན་པོ་ཆེའི་ཕུང་པོ་དུ་མ་དག་ནི་བཞག
en: “ ‘I had also prepared a hundred thousand precious seats, numerous heaps of gold, heaps of silver, and heaps of jewels.

source: གོས་དང་རྒྱན་གྱི་ཕུང་པོ་དུ་མ་དག་ནི་བཞག །
en: “ ‘I had prepared numerous heaps of clothing and jewelry.

source: བ་ལང་གི་རིགས་བརྒྱ་སྟོང་དུ་མ་རྫི་དང་ལྡན་པ་དག་ནི་སྟ་གོན་བགྱིས། །
en: “ ‘I had prepared many hundreds of thousands of herds of cows along with herders.

source: ཟས་དང་སྐོམ་མང་པོ་དག་ནི་བཞག །
en: “ ‘I had prepared numerous kinds of food and drink.

source: ལྷའི་ཟས་རོའི་རོ་མཆོག་དང་ལྡན་པ་དག་ནི་སྟ་གོན་བགྱིས།
en: I had prepared divine food with supreme flavors.

source: གསེར་དང་དངུལ་གྱི་དྲིལ་བུ་རིན་པོ་ཆེས་སྤྲས་པ་དག་ནི་རྟག་ཏུ་བཞག
en: “ ‘I had continuously prepared bejeweled bells of gold and silver,

source: གསེར་དང་དངུལ་གྱི་སེང་གེའི་ཁྲིའུ་དུ་མ་དག་ནི་རིན་པོ་ཆེས་སྤྲས།
en: many bejeweled lion thrones of silver and gold,

source: ལྷའི་གཡག་རྔའི་རྡུལ་ཡབ་ཀྱི་རྩ་བ་དང་། གདུགས་དང་། ལྷ་མ་དག་ནི་གསེར་གྱིས་བརྒྱན། གསེར་གྱི་ཅོད་པན་སྟོང་ཕྲག་དུ་མ་དག་ནི་རིན་པོ་ཆེས་བརྒྱན་ཅིང་བཞག་པ་དང་། །
en: many thousands of divine yak-tail whisks, parasols, shoes adorned with gold, and bejeweled gold diadems.

source: དེའི་ཚེ་རྒྱལ་པོ་ནི་སྟོང་ཚོགས། བྲམ་ཟེ་ནི་འབུམ་ཚོགས། རྒྱལ་རིགས་ནི་འབུམ་ཕྲག་དུ་མ་ཚོགས་ཏེ།
en: “ ‘At that time, I had invited a thousand kings, a hundred thousand brahmins, and many hundreds of thousands of kṣatriyas,

source: དེའི་ཚེ་བདག་གིས་སའི་གདུགས་གཅིག་ཏུ་བགྱིས་པ་བདག་ངོ་མཚར་དུ་གྱུར་ཏེ། །
en: and I became arrogant on seeing that I was their sole ruler.

source: དེ་བས་ན་ཐོག་མའི་སྡིག་པ་མཐོལ་ལོ་བཤགས་སོ། །
en: “ ‘I now confess my first bad action.

source: རྒྱལ་རིགས་ཀྱི་ཆུང་མ་རྣམས་ནི་སྙིང་གར་དྲལ་ཏེ།
en: I tore out the hearts of the kṣatriya wives,

source: ཁྱེའུ་དང་བུ་མོ་གཞོན་ནུ་དག་སྲོག་བཅད།
en: slaughtered the boys and girls,

source: རྒྱལ་རིགས་ཆེན་པོ་དག་ཐམས་ཅད་ནི་ཁུ་སྒོ་དང་། ལྕགས་ཀྱིས་བཅིངས་ནས་ཟངས་ཀྱི་བྲག་ཕུག་ཏུ་ཁྲིད་དེ།
en: bound all the great kṣatriyas in stocks and shackles, and took them to a copper cave.

source: རྒྱལ་རིགས་འབུམ་ཕྲག་དུ་མ་ནི་ཟངས་ཀྱི་བྲག་ཕུག་དེར་སྩལ།
en: I imprisoned many hundreds of thousands of kṣatriyas in that copper cave.

source: ཁ་ཤ་དང་པ་ནད་པ་ལ་སོགས་པའི་རྒྱལ་རིགས་དེ་དག་ནི་ལྕགས་ཐག་ལྕགས་ཀྱི་ཕུར་པ་དང་ལྡན་པས་རྐང་ལག་བཅིངས་ནས་ཕུག་དེར་བཞག་སྟེ།
en: I fastened the legs and arms of those kṣatriyas, such as the Khasas and Pāṇḍavas, with iron chains and iron pegs to keep them in that cave.

source: དེའི་ཚེ་བདག་གིས་ཆབ་སྒོ་ཐམས་ཅད་ཀྱང་བཀུམ་མོ། །
en: “ ‘I made doors for the cave:

source: དང་པོ་ནི་ཤིང་གི་སྒོའོ། །
en: the first door was made of wood,

source: གཉིས་པ་ནི་སེང་ལྡེང་གི་སྒོའོ།
en: the second door was made of acacia,

source: གསུམ་པ་ནི་འཁར་བའི་སྒོའོ། །
en: the third door was made of bronze,

source: བཞི་པ་ནི་ཟངས་ཀྱི་སྒོའོ། །
en: the fourth door was made of copper,

source: ལྔ་པ་ནི་ལྕགས་ཀྱི་སྒོའོ། །
en: the fifth door was made of iron,

source: དྲུག་པ་ནི་དངུལ་གྱི་སྒོའོ། །
en: the sixth door was made of silver,

source: བདུན་པ་ནི་གསེར་གྱི་སྒོ་སྟེ།
en: and the seventh door was made of gold.

source: གསེར་གྱི་སྒོ་དེར་རི་བདུན་གཅིག་གི་སྟེང་དུ་གཅིག་བརྩེགས་ཏེ་བཞག་གོ། །
en: Then I heaped seven mountains, one on top of the other, in front of the golden door.

source: དེ་ནས་བདག་གིས་ཤིང་རྟ་བཅུ་པའི་བུ་ཚོལ་ཞིང་གདུགས་ལ་ལ་ལ་ནི་སྦྲང་བུའི་གཟུགས་ཀྱིས། །
en: “ ‘Then I went in search of Daśarathaputra, one day in the form of a beggar,

source: གདུགས་ལ་ལ་ལ་ནི་བུང་བའི་གཟུགས་ཀྱིས།
en: one day in the form of a bee,

source: གདུགས་ལ་ལ་ལ་ནི་ཕག་གི་གཟུགས་ཀྱིས།
en: one day in the form of a pig,

source: གདུགས་ལ་ལ་ལ་ནི་མིའི་གཟུགས་ཀྱིས་དེ་ལྟར་བསྒྱུར་ཏེ།
en: and one day in the form of a man,

source: གདུགས་རེ་རེ་ཞིང་གཞན་དང་གཞན་གྱི་གཟུགས་ཀྱིས་མཆི་ཡང་མངོན་དུ་མ་མཐོང་ནས།
en: transforming into a different form each day, but I did not see him.

source: དེའི་ཚེ་བདག་གིས་རྗེས་སུ་བསམས་ཏེ་མཆོད་སྦྱིན་བགྱི་བར་བརྩམས་པ་དང་། །
en: “ ‘Then, after contemplating, I began to make my offerings.

source: དེའི་ཚེ་ཤིང་རྟ་བཅུ་པའི་བུ་གླགས་ཚོལ་བ་མཆིས་ཏེ། དེས་རི་བདུན་དྲལ་ཅིང་གཤེགས་ནས་མྱུར་དུ་ཕྱོགས་གཞན་དུ་བོར་ཏེ་
en: Daśaratha­putra, seizing the opportunity, quickly removed the seven mountains, throwing them to another place.

source: རྒྱལ་རིགས་དེ་དག་ལ་སྐད་ཆེར་སྨྲས་པ་དང་།
en: He then shouted loudly to the kṣatriyas.

source: རྒྱལ་པོ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་སོ། །ཐོས་ནས་དབུགས་ཕྱིན་པར་གྱུར་ཏེ་གནས་པ་དང་། །
en: the other kings heard him and were relieved and comforted.

source: ཁྱེད་ཅག་གསོན་ནམ་ཤི་
en: “Are you alive or dead?”

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་གསོན་ནོ་ཞེས་སྨྲས་སོ། །
en: “ ‘They replied, “We are alive, Bhagavat.”

source: དེ་ནས་སྐྱེས་བུ་དཔའ་བོ་ཆེན་པོ་དེས་སྒོ་དེ་དག་ཐམས་ཅད་བཅོམ་ནས་ཟངས་ཀྱི་ཕུག་དེ་དག་མཐོང་བ་དང་།
en: “ ‘Then the great hero destroyed all the doors and looked inside the copper cave.

source: རྒྱལ་པོ་བཅིངས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་མཐུ་བོ་ཆེ་མཐོང་ནས་
en: All the bound kings saw Nārāyaṇa.

source: ཡང་ན་ནི་ལྷ་མ་ཡིན་གཏོར་མ་ཤིའོ། །འཆི་བའི་དུས་བྱས་སོ། །ཡང་ན་ནི་བདག་ཅག་བསད་པའི་དུས་ལ་བབ་པ་ལྟ་ཞིག་ཅེས་ཕན་ཚུན་དུ་སེམས་པ་ལས།
en: They discussed among each other, saying, “Either the time has come for the asura king Bali to die, or the time has come for us to be slain.”

source: ཞེས་གཅིག་ལ་གཅིག་དེ་སྐད་སྨྲའོ།
en: They said to each other,

source: བདག་ཅག་ནི་གཡུལ་གྱི་སར་ཤི་ན་ལེགས་ཀྱི་བཅིང་བས་བཅིངས་བཞིན་དུ་ཤི་ན་མ་ལེགས་ཏེ། །
en: “It is good if we die in battle, but it’s not good to die in chains.

source: བདག་ཅག་ནི་བཅིང་བས་བཅིངས་བཞིན་དུ་ཤི་བའི་དུས་བྱས་པར་གྱུར་ན་རྒྱལ་རིགས་ཀྱི་ཆོས་ཀྱང་མེད་པར་འགྱུར་གྱི།
en: If we die in chains, the way of the kṣatriyas will come to an end,

source: གཡུལ་གྱི་སར་ཤི་བའི་དུས་བྱས་ན་ནི་བདག་ཅག་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: but if we die on the battlefield, we will be reborn in the higher realms.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་བདག་བདག་གི་ཁབ་ཏུ་དོང་སྟེ་ཤིང་རྟ་འདྲེན་པའི་རྟ་དུ་མ་སྟ་གོན་བགྱིས་སོ། །
en: “ ‘Then all the great kings returned to their own cities and made preparations with many horse-drawn chariots.

source: གང་གི་ཚེ་ན་དེ་དག་གིས་ཤིང་རྟ་དང་མཚོན་ཆ་རིན་པོ་ཆེ་ཆེན་པོ་དག་སྟ་གོན་བགྱིས་པ་དེའི་ཚེ་
en: “ ‘While they prepared their very precious chariots and weapons,

source: ཤིང་རྟ་བཅུ་པའི་བུ་མིའུ་ཐུང་གི་གཟུགས་སུ་སྤྲུལ་ནས་རི་དགས་ཀྱི་པགས་པ་སེ་རལ་དུ་ཐོགས། སྨྱིག་མའི་འཁར་བ་ཐོགས། ཁྲིའུ་འཚལ་ཏེ་
en: Daśaratha­putra transformed himself into a dwarf who wore a deerskin as a sash, held a bamboo staff, and carried a stool.

source: བདག་གི་དྲུང་དུ་མཆིས་ནས་ཆབ་སྒོར་ཕྱིན་པ་དང་།
en: He came to where I was and arrived at my door.

source: སྒོ་བས་བྲམ་ཟེ་མིའུ་ཐུང་མ་འགྲོ་ཤིག་ཅེས་བསྒྲགས་ནས། །
en: “ ‘The guard stationed there said, “Brahmin dwarf, you can’t enter.”

source: དེས་བདག་ནི་ཤུལ་རིང་པོ་ནས་མཆིས་སོ་ཞེས་སྨྲས་སོ།
en: “ ‘He said, “I have come a long way.”

source: དེ་ནས་སྒོ་བས་དེ་ལ་བྲམ་ཟེ་ས་གང་ནས་འོངས་ཞེས་དེ་སྐད་སྨྲས་པ་དང་།
en: “ ‘Then the guard asked, “Brahmin, where do you come from?”

source: བདག་ནི་ཟླ་བའི་གླིང་ནས་རྒྱལ་པོ་དྲང་སྲོང་གི་དྲུང་དུ་མཆིས་སོ། །
en: “ ‘He answered, “I have come to the rishi king from Candradvīpa.”

source: ལྷ་ཁྱོད་ཀྱི་ཞལ་སྔར་བྲམ་ཟེ་མིའུ་ཐུང་ཞིག་མཆིས་སོ་
en: “Your Majesty, a brahmin dwarf has arrived here.”

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མས་ཅིའི་དངོས་པོ་ཞིག་སློང་ཞེས་དེ་སྐད་སྨྲས་པ་དང་།
en: “ ‘I, the lord of the asuras, asked, “What is it that he requires?”

source: ལྷ་མ་འཚལ་ཏེ་
en: “Your Majesty, I don’t know.”

source: ཁྱོད་སོང་ལ་བྲམ་ཟེ་དེ་ཁྲིད་དེ་ཤོག་ཤིག་
en: “Go and bring the brahmin to me.”

source: སྒོ་བ་དེས་དེ་བོས་ཏེ་བྲམ་ཟེ་ཆེན་པོ་བཞུད་ཅིག་ཅེས་སྨྲས་ནས་
en: “ ‘The guard summoned him, saying, “Come in, great brahmin.”

source: དེ་ནང་དུ་སོང་བ་དང་རིན་པོ་ཆེའི་ཁྲིའུ་ལ་བཞག་སྟེ། །
en: “ ‘Then he came inside and was placed on a precious seat.

source: པ་བ་སངས་ཀྱང་དེའི་ཚེ་ན་དེ་ན་གནས་སོ། །དེ་ཡང་དེའི་མཁན་པོར་གྲགས་ནས་དེས་གཏོར་མ་ལ་འདི་ནི་དུས་ཀྱི་སྐྱེས་བུ་འདྲ་བ་ཞིག་ཕྱིན་ཏེ་ཁྱོད་ལ་ངེས་པར་བར་ཆད་བྱེད་དོ་ཞེས་དེ་སྐད་སྨྲས་སོ། །
en: “ ‘Śukra, who was renowned as my upādhyāya, was also present at this time and said to me, “This is a person who brings doom. He will certainly cause you an obstacle.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་མཁྱེན།
en: “Bhagavat, how do you know that?”

source: ངས་ནི་ལྟས་དང་མཚན་མ་ལས་ཤེས་སོ། །
en: “I know by seeing his signs and omens.”

source: བདག་ཅག་གི་ཐབས་ཇི་ལྟ་བུ་ཞིག་བགྱི།
en: “ ‘I asked, “What can we do?”

source: དེ་ནས་མཐུ་བོ་ཆེས་ངེས་པར་སྦྱིན་པ་ལ་འགྱོད་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས་དེས་དེའི་ཁར་ས་ར་སྭ་ཏི་བཅུག་པ་དང་།
en: “ ‘Nārāyaṇa thought, “If he thinks about this, he will definitely decide against making a gift, so I will put divinely inspired speech into his mouth.”

source: བྲམ་ཟེ་ཚུར་ཤོག །
en: “Come here, brahmin.

source: ཁྱོད་ཇི་ལྟ་བུར་སེམས།
en: What is your wish?”

source: བྲམ་ཟེ་དེས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “ ‘The brahmin answered,

source: གོམ་པ་གཉིས་ཤིག་གསོལ་ཏོ། །
en: “I ask for two steps of ground.”

source: བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཇི་ལྟར་གོམ་པ་གཉིས་བླངས་ན་ངས་ནི་གོམ་པ་གསུམ་སྦྱིན་ནོ། །
en: “ ‘I said, “Great brahmin, if you are asking for two steps, I will give you three.”

source: དེ་ནས་བླང་བ་བླངས་ནས་བཀྲ་ཤིས་སོ་ཞེས་སྨྲས་ཏེ། །
en: “ ‘The dwarf accepted this gift, saying, “This is auspicious.”

source: དེས་ཆུ་དང་ཏིལ་དང་གསེར་དུ་བཅས་པ་བླངས་སོ། །དེ་ནས་མིའུ་ཐུང་དེའི་གཟུགས་མི་སྣང་བར་བྱས་སོ། །
en: He accepted it along with a gift of water, sesame, and gold, and then vanished.

source: དེ་ནས་པ་བ་སངས་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “ ‘Śukra said to me,

source: རྒྱལ་པོའི་དྲང་སྲོང་ཁོ་བོས་དུས་ཀྱི་སྐྱེས་བུ་འོངས་སོ་ཞེས་བྱས་ན་ཁྱོད་ཀྱིས་ངའི་ཚིག་མ་མཉན་ཏེ། །
en: “Rishi King, I said that this was a man of doom who had come, but you did not pay heed to what I said.

source: ལས་དེའི་འབྲས་བུ་མྱོང་བར་གྱིས་ཤིག
en: So may you experience the result of your actions!”

source: དེས་བདག་གི་ལུས་ཆེན་པོར་བསྒྱུར་བ་དང་ཉི་མ་དང་ཟླ་བ་ནི་དེའི་ཕྲག་པ་ལ་གནས།
en: “ ‘Then Nārāyaṇa appeared in his own form. He was vast, with the sun and moon on his shoulders,

source: ལག་ན་ནི་རལ་གྲི་དང་། གཞུ་དང་། འཁོར་ལོ་དང་། མཚོན་ཆ་དག་ཐོགས་སོ། །
en: and holding a sword, a bow, a wheel, a long spear, and a short spear in his hands.

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མ་ཁ་བུབ་ཏུ་འགྱེལ་ནས་དྲན་པ་ཉམས་ཏེ་འདར་འདར་པོར་བྱས་ནས་བདག་གིས་ཅི་བགྱིས་རང་གི་ལག་ནས་དུག་འཚལ་བ་ལྟ་ཞེས་སྨྲས་སོ།
en: I, lord of the asuras, became faint, grew dizzy, fell headlong, and said, “What have I done? I have taken poison with my own hand!”

source: གོམ་པ་གཉིས་ནི་ཚང་ན་གསུམ་པ་བྱིན་ཅིག་ཅེས་སྨྲས་པ་དང་།
en: “ ‘Nārāyaṇa took two steps and said, “Give me my third step!”

source: གསུམ་པ་མ་མཆིས་སོ་ཞེས་དེས་སྨྲས་སོ།
en: “ ‘I said, “There can be no third.

source: ཁོ་བོས་བླང་བ་ཡང་བླངས་སོ། །
en: You have taken all the ground that can be taken.

source: བདག་གིས་ཐབས་ཇི་ལྟ་བུ་ཞིག་བགྱི། །
en: What can I do?”

source: ངས་གར་བཞག་པ་དེར་ཁྱོད་ཀྱིས་འདུག་པར་གྱིས་ཤིག །
en: “Wherever I place you, there shall you stay.”

source: དེ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “ ‘Then I, lord of the asuras, said to him,

source: བདག་ནི་བཀའ་ཅི་སྩལ་པ་དེ་བཞིན་དུ་བགྱིད་དོ།
en: “Whatever you command, that I will do.”

source: མད་དོ་མེད་དོ་
en: “Is this true? Is this true?”

source: མད་དོ་མད་པར་བགྱིད་དོ། །
en: “It’s the truth, it’s the truth.”

source: དེས་བདེན་པའི་ཞགས་པས་བཅིངས་ནས་
en: “ ‘Thus Nārāyaṇa caught me in the noose of truth.

source: མཆོད་སྦྱིན་གྱི་གནས་དེ་ཡང་བཤིག་གོ། །སྣོད་དེ་དག་ཀྱང་ལྷག་མ་ཅན་དུ་བགྱིས་སོ།
en: The offering site was destroyed and the offering bowls discarded.

source: བུ་མོ་གཞོན་ནུ་དེ་དག་ཀྱང་པན་ད་པ་དང་། ཀོའུ་ར་བ་དག་གིས་མནོལ་བར་བགྱིས་སོ།
en: The Pāṇḍavas and Kauravas took away the maidens.

source: སེང་གེའི་ཁྲི་དེ་དག་དང་། ལྷའི་གདུགས་དེ་དག་དང་། ལྷ་མ་རིན་པོ་ཆེས་བརྒྱན་པ་དེ་དག་དང་། གོས་དང་རྒྱན་དེ་དག་དང་། གསེར་གྱི་དཔུང་རྒྱན་རིན་པོ་ཆེས་སྤྲས་པ་དེ་དག་དང་། གླང་སེར་སྐྱ་དེ་དག་ཀྱང་པན་ད་པ་དང་ཀོའུ་ར་བ་དེ་དག་གིས་འཚལ་ཏོ། །བདག་གི་ས་གཞི་དེ་དག་ཀྱང་བཅོམ་མོ། །
en: The Kauravas, Pāṇḍavas, and the others took away the golden lion thrones, the divine parasols, the bejeweled shoes, the clothing, the jewelry, the bejeweled golden armlets, and the tawny cows, destroying the offering site.

source: ཐབས་མ་འཚལ་བས་དུས་མ་ལགས་པར་སྦྱིན་པ་བྱིན་པས་བཅིངས་པ་ཉིད་ཐོབ་པར་གྱུར་ཏེ།
en: “I was about to make an excellent offering, but I made an unfortunate offering that has resulted in this bondage.

source: ལྷ་ལ་ཕྱག་འཚལ་ལོ་
en: Homage to you, lord.

source: དེ་ཁྲིད་ནས་བྱེད་པ་པོ་བཞིན་དུ་སླས་དང་འཁོར་དང་བཅས་ཏེ་སའི་འོག་ཏུ་བཞག་གོ། །
en: “ ‘Then Nārāyaṇa took me, my queens, and my retinue and placed us in the underworld.

source: བདག་གིས་སྔོན་ཞིང་ངན་པ་ལ་སྦྱིན་པ་བགྱིས་སོ་
en: In the past I made that gift to a bad recipient,

source: ཕྱག་ན་མེ་ཏོག་པད་མ་བཟང་པོ་ཐོགས་པས་སྐྱབས་མཛོད་ཅིག །
en: “ ‘Be my refuge, holder of beautiful lotuses.

source: བདག་གིས་བསྟོད་པ་འདི་བགྱིས་སོ། །
en: “ ‘I make this praise

source: སྐྲའི་ཅོད་པན་ཐོགས་པ།
en: the one who wears a matted topknot;

source: ཐམས་ཅད་མཁྱེན་པ་དབུ་ན་བཞུགས་པ།
en: to the one who has an omniscient buddha upon his head;

source: སེམས་ཅན་མང་པོ་དབུགས་འབྱིན་པར་མཛད་པ།
en: to the one who brings relief to many beings;

source: དམན་པ་དང་ཕོངས་པ་ལ་ཐུགས་རྗེ་བ།
en: to the one who has compassion for the inferior and desolate;

source: གདུགས་བཞིན་དུ་སྤྱན་བཟང་བ།
en: the one who has beautiful eyes like parasols;

source: སའི་སྤྱན་དམ་པ།
en: to the one who has illuminated the world;

source: སྨན་གྱི་རྒྱལ་པོའི་མཆོག །
en: to the one who is a supreme king of healing;

source: སེམས་ཅན་ཤིན་ཏུ་དག་པ།
en: to the one who is a perfectly pure being;

source: རྣལ་འབྱོར་རབ་ཏུ་ཐོབ་པ།
en: to the one who has the supreme attainment of yoga;

source: ཐར་པ་རབ་མཆོག་ཅན།
en: to the one who has perfect liberation;

source: ཐར་པ་ལ་དགྱེས་པ།
en: to the one who is a lover of liberation;

source: ནོར་བུ་ཡིད་བཞིན་དང་འདྲ་བ་ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་སྐྱོང་བར་མཛད་པ།
en: to the one who is like a wish-fulfilling jewel; to the one who protects the treasure of the Dharma;
